Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMDA1_DFP/2.2.43/edc/ATSAMDA1E14B.PIC
      <edc:SFRDef edc:_addr="0x4100445F" edc:access="-n---nnn" edc:cname="GROUP0PINCFG31" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004460" edc:offset="0x3A0"/>
      <edc:SFRDef edc:_addr="0x41004800" edc:access="----nnnn-----nnn" edc:cname="CTRL" edc:impl="0xF07" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAENABLE" edc:desc="DMA Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCENABLE" edc:desc="CRC Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LVLEN0" edc:desc="Priority Level 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEN1" edc:desc="Priority Level 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEN2" edc:desc="Priority Level 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEN3" edc:desc="Priority Level 3 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004802" edc:access="--nnnnnn----nnnn" edc:cname="CRCCTRL" edc:impl="0x3F0F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCBEATSIZE" edc:desc="CRC Beat Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="Byte bus access" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HWORD" edc:desc="Half-word bus access" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="Word bus access" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CRCPOLY" edc:desc="CRC Polynomial Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CRC16" edc:desc="CRC-16 (CRC-CCITT)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CRC32" edc:desc="CRC32 (IEEE 802.3)" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CRCSRC" edc:desc="CRC Input Source" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No action" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O interface" edc:when="(field &amp; 0x3F) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004804" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CRCDATAIN" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCDATAIN" edc:desc="CRC Data Input" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004808" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CRCCHKSUM" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCCHKSUM" edc:desc="CRC Checksum" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100480C" edc:access="------nn" edc:cname="CRCSTATUS" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCBUSY" edc:desc="CRC Module Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCZERO" edc:desc="CRC Zero" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100480D" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100480E" edc:access="--nnnnnn" edc:cname="QOSCTRL" edc:impl="0x3F" edc:mclr="00010101" edc:nzwidth="0x8" edc:por="00010101" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="WRBQOS" edc:desc="Write-Back Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FQOS" edc:desc="Fetch Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DQOS" edc:desc="Data Transfer Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100480F" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x41004810" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SWTRIGCTRL" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWTRIG0" edc:desc="Channel 0 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG1" edc:desc="Channel 1 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG2" edc:desc="Channel 2 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG3" edc:desc="Channel 3 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG4" edc:desc="Channel 4 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG5" edc:desc="Channel 5 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG6" edc:desc="Channel 6 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG7" edc:desc="Channel 7 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG8" edc:desc="Channel 8 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG9" edc:desc="Channel 9 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG10" edc:desc="Channel 10 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG11" edc:desc="Channel 11 Software Trigger" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004814" edc:access="n---nnnnn---nnnnn---nnnnn---nnnn" edc:cname="PRICTRL0" edc:impl="0x8F8F8F8F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLPRI0" edc:desc="Level 0 Channel Priority Number" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN0" edc:desc="Level 0 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI1" edc:desc="Level 1 Channel Priority Number" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN1" edc:desc="Level 1 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI2" edc:desc="Level 2 Channel Priority Number" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN2" edc:desc="Level 2 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI3" edc:desc="Level 3 Channel Priority Number" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN3" edc:desc="Level 3 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004818" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x41004820" edc:access="nnn--nnn----nnnn" edc:cname="INTPEND" edc:impl="0xE70F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Channel ID" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TERR" edc:desc="Transfer Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:desc="Transfer Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Channel Suspend" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="Fetch Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEND" edc:desc="Pending" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004822" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41004824" edc:access="--------------------rrrrrrrrrrrr" edc:cname="INTSTATUS" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CHINT0" edc:desc="Channel 0 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT1" edc:desc="Channel 1 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT2" edc:desc="Channel 2 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT3" edc:desc="Channel 3 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT4" edc:desc="Channel 4 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT5" edc:desc="Channel 5 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT6" edc:desc="Channel 6 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT7" edc:desc="Channel 7 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT8" edc:desc="Channel 8 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT9" edc:desc="Channel 9 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT10" edc:desc="Channel 10 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT11" edc:desc="Channel 11 Pending Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004828" edc:access="--------------------rrrrrrrrrrrr" edc:cname="BUSYCH" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BUSYCH0" edc:desc="Busy Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH1" edc:desc="Busy Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH2" edc:desc="Busy Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH3" edc:desc="Busy Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH4" edc:desc="Busy Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH5" edc:desc="Busy Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH6" edc:desc="Busy Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH7" edc:desc="Busy Channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH8" edc:desc="Busy Channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH9" edc:desc="Busy Channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH10" edc:desc="Busy Channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH11" edc:desc="Busy Channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100482C" edc:access="--------------------rrrrrrrrrrrr" edc:cname="PENDCH" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PENDCH0" edc:desc="Pending Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH1" edc:desc="Pending Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH2" edc:desc="Pending Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH3" edc:desc="Pending Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH4" edc:desc="Pending Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH5" edc:desc="Pending Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH6" edc:desc="Pending Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH7" edc:desc="Pending Channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH8" edc:desc="Pending Channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH9" edc:desc="Pending Channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH10" edc:desc="Pending Channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH11" edc:desc="Pending Channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
